<template>
    <v-container>
      <v-row>
        <v-col v-for="(events, month) in schedule" :key="month" cols="12" sm="6" md="3">
          <v-card class="pa-4 h-100 card-stat-shadow">
            <v-card-title class="text-h6">{{ month }}</v-card-title>
            <v-card-text>
              <ul>
                <li v-for="event in events" :key="event.title">
                  {{ event.date }} - {{ event.title }}
                </li>
              </ul>
            </v-card-text>
            <div>
                <hr class="my-3" style="color:#707070 ;">
              <v-chip v-for="tag in events.flatMap(e => e.tags)" :key="tag" class="ma-1" color="#96CCD5" variant="flat">
                {{ tag }}
              </v-chip>
            </div>
          </v-card>
        </v-col>
      </v-row>
    </v-container>
  </template>
  
  <script setup>
  const schedule = {
    "ต.ค.": [
      { date: "13 ต.ค.", title: "วันน้อมรำลึกมหาราช", tags: ["#รัชการที่9", "#สมเด็จ"] },
      { date: "21 ต.ค.", title: "วันคล้ายวันพระราชสมภพ สมเด็จพระศรีนครินทราบรมราชชนนี", tags: ["#แม่ฟ้าหลวง", "#รำลึก"] },
      { date: "23 ต.ค.", title: "วันปิยมหาราช", tags: ["#รัชกาลที่ 5", "#วันปิยมหาราช"] },
    ],
    "พ.ย.": [
      { date: "14 พ.ย.", title: "วันพระบิดาแห่งฝนหลวง", tags: ["#วันแห่งฝนหลวง", "#ฝนเทียม"] },
    ],
    "ธ.ค.": [
      { date: "5 ธ.ค.", title: "วันพ่อแห่งชาติ", tags: ["#ทำดีเพื่อพ่อ", "#วันพ่อ"] },
      { date: "10 ธ.ค.", title: "วันรัฐธรรมนูญ", tags: ["#วันรัฐธรรมนูญ", "#วันสำคัญ"] },
      { date: "28 ธ.ค.", title: "วันสมเด็จพระเจ้าตากสินมหาราช", tags: ["#สมเด็จพระเจ้าตากสิน"] },
    ],
    "ม.ค.": [
      { date: "8 ม.ค.", title: "วันคล้ายวันประสูติ 918", tags: ["#วันองค์เทพกุมาร", "#4320วันยุทธศาสตร์"] },
      { date: "17 ม.ค.", title: "วันยุทธหัตถี", tags: ["#วันกองทัพไทย"] },
      { date: "18 ม.ค.", title: "วันกองทัพไทย", tags: ["#กองทัพ"] },
    ],
    "ก.พ.": [
    { date: "2 ก.พ.", title: "วันเกษตรแห่งชาติ", tags: ["#ภาคการเกษตร", "#เราคู่กสิกรรม"] },
    { date: "3 ก.พ.", title: "วันทหารผ่านศึก", tags: ["#สดุดีวีรชน"] },
  ],
  "มี.ค.": [
    { date: "31 มี.ค.", title: "วันพระบาทสมเด็จพระนั่งเกล้าเจ้าอยู่หัว", tags: ["#วันพระนั่งเกล้า", "#วันอนุชา"] },
  ],
  "เม.ย.": [
    { date: "2 เม.ย.", title: "วันคล้ายวันราชสมภพ 905", tags: ["#สมเด็จพระเทพฯ"] },
    { date: "6 เม.ย.", title: "วันจักรี", tags: ["#จักรีราชวงศ์"] },
    { date: "25 เม.ย.", title: "วันคล้ายวันสวรรคตสมเด็จพระนเรศวรมหาราช", tags: ["#ตรวจเลือดทหาร67", "#ผลการรบอินทา"] },
    { date: "29 เม.ย.", title: "วันคล้ายวันประสูติ 919", tags: ["#วันจักรี"] },
  ],
  "พ.ค.": [
    { date: "4 พ.ค.", title: "วันฉัตรมงคล", tags: ["#มงคลบารมี", "#ฉัตรมงคล"] },
    { date: "10 พ.ค.", title: "วันวิสาขบูชา", tags: ["#พระโก", "#วันพระ"] },
  ],
  "มิ.ย.": [
    { date: "2 มิ.ย.", title: "วันเกษตรแห่งชาติ", tags: ["#ภาคการเกษตร", "#เราคู่กสิกรรม"] },
    { date: "3 มิ.ย.", title: "วันทหารผ่านศึก", tags: ["#สดุดีวีรชน"] },
  ],
  "ก.ค.": [
    { date: "31 ก.ค.", title: "วันพระบาทสมเด็จพระนั่งเกล้าเจ้าอยู่หัว", tags: ["#วันพระนั่งเกล้า", "#วันอนุชา"] },
  ],
  "ส.ค.": [
    { date: "2 ส.ค.", title: "วันคล้ายวันราชสมภพ 905", tags: ["#สมเด็จพระเทพฯ"] },
    { date: "6 ส.ค.", title: "วันจักรี", tags: ["#จักรีราชวงศ์"] },
    { date: "25 ส.ค.", title: "วันคล้ายวันสวรรคตสมเด็จพระนเรศวรมหาราช", tags: ["#ตรวจเลือดทหาร67", "#ผลการรบอินทา"] },
    { date: "29 ส.ค.", title: "วันคล้ายวันประสูติ 919", tags: ["#วันจักรี"] },
  ],
  "ก.ย.": [
    { date: "4 ก.ย.", title: "วันฉัตรมงคล", tags: ["#มงคลบารมี", "#ฉัตรมงคล"] },
    { date: "10 ก.ย.", title: "วันวิสาขบูชา", tags: ["#พระโก", "#วันพระ"] },
  ],
  };
  </script>
  
  <style scoped>
  .v-card {
    border-radius: 12px;
  }
  </style>
  